prescriptions/gatherer/app/controllers/projects_controller.rb

INSERT INTO `projects` (`name`, `created_at`, `updated_at`) VALUES (?, ?, ?)  [["name", "one"], ["created_at", "2015-01-24 07:17:54"], ["updated_at", "2015-01-24 07:17:54"]]
INSERT INTO `tasks` (`title`, `size`, `project_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?)  [["title", "task one"], ["size", 1], ["project_id", 1], ["created_at", "2015-01-24 07:17:54"], ["updated_at", "2015-01-24 07:17:54"]]
---
  def create

    @action = CreatesProject.new( name: params[:project][:name], task_string: params[:project][:tasks])
    @action.create