emberjs/crm/backend/app/controllers/api/v1/leads_controller.rb

  def index
    puts Lead.all
---
SELECT `leads`.* FROM `leads`